---
kind: method
id: M:Autodesk.Revit.DB.CurveArray.Clear
source: html/d4ce9472-5208-b2ff-4240-e91e6f7d8ace.htm
---
# Autodesk.Revit.DB.CurveArray.Clear Method

Removes every curve from the array, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```